//
//  BaiduShareError.swift
//  Aria2D
//
//  Created by xjbeta on 2018/9/23.
//  Copyright © 2018 xjbeta. All rights reserved.
//

import Cocoa

class BaiduShareError: NSError {
    
    
}


//0: "成功",
//"-1": "由于您分享了违反相关法律法规的文件，分享功能已被禁用，之前分享出去的文件不受影响。",
//"-2": "用户不存在,请刷新页面后重试",
//"-3": "文件不存在,请刷新页面后重试",
//"-4": "登录信息有误，请重新登录试试",
//"-5": "登录信息有误，请重新登录试试",
//"-6": "请重新登录",
//"-7": "该分享已删除或已取消",
//"-8": "该分享已经过期",
//"-9": "访问密码错误",
//"-10": "分享外链已经达到最大上限100000条，不能再次分享",
//"-11": "验证cookie无效",
//"-14": "对不起，短信分享每天限制20条，你今天已经分享完，请明天再来分享吧！",
//"-15": "对不起，邮件分享每天限制20封，你今天已经分享完，请明天再来分享吧！",
//"-16": "对不起，该文件已经限制分享！",
//"-17": "文件分享超过限制",
//"-19": "验证码输入错误，请重试",
//"-20": "请求验证码失败，请重试",
//"-21": "未绑定手机或邮箱，没有权限私密分享",
//"-22": "被分享的文件无法重命名，移动等操作",
//"-30": "文件已存在",
//"-31": "文件保存失败",
//"-32": "你的空间不足了哟，赶紧购买空间吧",
//"-33": "一次支持操作999个，减点试试吧",
//"-40": "热门推荐失败",
//"-60": "相关推荐数据异常",
//"-62": "密码输入次数达到上限",
//"-64": "描述包含敏感词",
//"-70": "你分享的文件中包含病毒或疑似病毒，为了你和他人的数据安全，换个文件分享吧",
//1: "服务器错误",
//2: "参数错误",
//3: "未登录或帐号无效",
//4: "存储好像出问题了，请稍候再试",
//12: "批量处理错误",
//14: "网络错误，请稍候重试",
//15: "操作失败，请稍候重试",
//16: "网络错误，请稍候重试",
//105: "创建链接失败，请重试",
//106: '文件读取失败，请<a href="javascript:window.location.reload();">刷新</a>页面后重试',
//108: "文件名有敏感词，优化一下吧",
//110: "您今天分享太多了，24小时后再试吧",
//111: "外链转存失败，请稍候重试",
//112: '页面已过期，请<a href="javascript:window.location.reload();">刷新</a>后重试',
//113: "外链签名有误",
//114: "当前任务不存在，保存失败",
//115: "该文件禁止分享",
//116: "分享不存在",
//117: "分享已经过期",
//2126: "文件名中含有敏感词",
//2161: "文件中含有违规内容",
//2135: "对方拒绝接收消息",
//2136: "对方拒接非好友消息",
//2102: "群组不存在",
//2103: "你已退出该群",
//2101: "你已达到创建2000群上限",
//2100: "用户都已经被添加过",
//2119: "群成员已满",
//" -73": "创建群个数超过上限"
